Revit 2024 API
ComponentRepeaterSlot.IsEmpty Property
 A flag indicating whether the slot is currently empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsEmpty { get; }
Visual Basic
Public ReadOnly Property IsEmpty As Boolean
	Get
Visual C++
public:
property bool IsEmpty {
	bool get ();
}
See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace